const inputRange = document.querySelector(".input-range")
const count = document.querySelector(".count")
const nickList = document.querySelector(".nicklist")
const generate = document.querySelector(".generate")

const verbs = [ 
    verbs1 = ["дырявый", "ядерный", "обрыганый", "грозный", "солевой", "резиновый", "деловой", "похотливый", "анальный", "zxc", "бешенный", "взрывной", "темнокожий", "боевой", "шершавый", "ржавый", "дерзкий", "потный", "вонючий", "великий", "мохнатый", "напряженный", "просроченный", "сексуальный", "премиум", "бронебойный", "арахисовый", "колхозный", "гнилой", "загадочный", "копченый", "квашенный", "адмирал", "дряхлый"],
    verbs2 = ["дырявая", "ядерная", "обрыганая", "грозная", "солевая", "резиновая", "деловая", "похотливая", "анальная", "zxc", "бешенная", "взрывная", "темнокожая", "боевая", "шершавая", "ржавая", "дерзкая", "потная", "вонючая", "великая", "мохнатая", "напряженная", "просроченная", "сексуальная", "премиум", "бронебойная", "арахисовая", "колхозная", "гнилая", "загадочная", "копченый", "квашенная", "адмирал", "дряхлая"],
    verb3 = ["дырявое", "ядерное", "обрыганое", "грозное", "солевое", "резиновое", "деловое", "похотливое", "анальное", "zxc", "бешенное", "взрывное", "темнокожое", "боевое", "шершавое", "ржавое", "дерзкое", "потное", "вонючое", "великое", "мохнатое", "напряженное", "просроченное", "сексуальное", "премиум", "бронебойное", "арахисовое", "колхозное", "гнилое", "загадочное", "копченое", "квашенное", "адмирал", "дряхлое"],
    verb4 = ["дырявые", "ядерные", "обрыганые", "грозные", "солевые", "резиноваые", "деловые", "похотливые", "анальные", "zxc", "бешенные", "взрывные", "темнокожие", "боевые", "шершавые", "ржавые", "дерзкие", "потные", "вонючие", "великие", "мохнатые", "напряженные", "просроченные", "сексуальные", "премиум", "бронебойные", "арахисовые", "колхозные", "гнилые", "загадочные", "копченые", "квашенные", "адмирал", "дряхлые"]
];
const items = [
    items1 = ["анальгин", "гранит", "гном", "сапог", "цемент", "отросток", "крот", "холокост", "нагетс", "геноцид", "жук", "школьник", "шакал", "киндер", "ежик", "объелдос", "цирк", "кобяков", "пулемет", "корнишон", "самогон", "аэрозоль", "шкаф", "рак", "завтрак", "окурок", "лось", "прыщь", "ишак", "пень", "гвоздь", "лосось", "мармелад", "утюг", "затупок", "трамвай", "демон", "абьюзер", "окунь", "кавун", "поручень", "слон", "израиль", "минет", "щелбан", "гарнир", "свинарник", "банан", "сухарик", "клитор", "тапочек", "выродок", "студент" ,"стакан", "папугай", "чизбургер", "пиздец", "курятник", "гомункул", "богомол", "пиво", "чай", "хлеб", "бурундук", "енот", "самовар", "бурбон", "алладин", "домовенок", "трубочист", "петух", "рис", "кашалот", "куст", "кабель", "пропеллер", "мухомор", "лаваш", "стриптизер", "ландыш", "бегемот", "шарик", "плинтус", "гастрит", "пегас", "отчим", "губошлеп", "агент", "террорист", "потрошитель", "комар", "узбекистан", "аллах", "хлопок", "терминатор", "вождь", "презерватив", "мусор"],
    items2 = ["кукуруза", "шкура", "сковородка", "борода", "индейка", "опухоль", "сметана", "козявка", "альтушка", "пилюля", "кикимора", "лодка", "штамповка", "сперма", "юбочка", "мартышка", "дылда", "мозоль", "пружинка", "яйцеклетка", "корка", "затычка", "агуша", "трость", "печь", "пятка", "свеча", "крепость", "ступня", "бочка", "тумбочка", "сопля", "моча", "секскукла", "гнида", "отрыжка", "вошь", "ворона", "штора", "сосулька", "дрочка", "кастрюля", "парасолька", "соль", "палка", "кружка", "сиська", "лягушка", "черешня", "шишка", "колбаса", "молекула", "родинка", "картошка", "бактерия", "слюна", "табуретка", "шухлядка", "люстра", "бактерия", "козюлька", "букашка", "гусеница", "мошонка", "розетка", "коробка", "капуста", "гречка", "салфетка", "селедка", "килька"],
    items3 = ["ведро", "масло", "куни", "яблоко", "чудище", "чучело", "семечко", "гнездо", "лахмотье"],
    items4 = ["огурцы", "тапочки", "кабачки", "окорочки", "сандали", "штаны", "колготки", "чулки", "яйца"]
];
// арбуз
function randChoice(array) {
    let randIndex = parseInt(Math.random() * (array.length + 0) + 0)
    return array[randIndex]
}

function generateNickname(times) {
    nickList.innerHTML = ''
    for (times; times > 0; times--) {
        const randGroup = parseInt(Math.random() * (3 + 0) + 0)
        const choosenGroupVerbs = verbs[randGroup]
        const choosenGroupItems = items[randGroup]
        const choosenVerb = randChoice(choosenGroupVerbs)
        const choosenItem = randChoice(choosenGroupItems)
        const newNick = document.createElement("li")
        newNick.innerHTML = `${choosenVerb} ${choosenItem}`
        nickList.appendChild(newNick)
    }
}

function checkWord(word) {
    let checked = false
    for (let i = 0; i < verbs.length; i++) {
        if (verbs[i].includes(word)) {
            checked = true
            break;
        }
    }
    for (let i = 0; i < items.length; i++) {
        if (items[i].includes(word)) {
            checked = true
            break;
        }
    }
    checked ? console.log(`слово "${word}" уже есть.`) : console.log(`слова "${word}" нет.`)
}



count.innerHTML = `кол-во: ${inputRange.value}`
inputRange.addEventListener("change", function() {
    count.innerHTML = `кол-во: ${inputRange.value}`
})

generate.addEventListener("click", () => {
    generateNickname(inputRange.value)
})